In [1]:
import pandas as pd
import random
from datetime import datetime, timedelta

# number of records
records = 1000

categories = ['Electronics', 'Fashion', 'Home & Kitchen', 'Books', 'Beauty', 'Sports']
payment_methods = ['Credit Card', 'Debit Card', 'UPI', 'Net Banking', 'Cash on Delivery']
order_status = ['Delivered', 'Cancelled', 'Returned']

start_date = datetime(2023, 1, 1)
end_date = datetime(2024, 12, 31)

data = []

for i in range(1, records + 1):
    date = start_date + timedelta(days=random.randint(0, (end_date - start_date).days))
    quantity = random.randint(1, 5)
    unit_price = random.randint(200, 50000)
    total_price = quantity * unit_price

    data.append([
        f"ORD{i:04d}",
        f"CUST{random.randint(1, 400):03d}",
        f"PROD{random.randint(1, 250):03d}",
        date.strftime('%Y-%m-%d'),
        random.choice(categories),
        quantity,
        unit_price,
        total_price,
        random.choice(payment_methods),
        random.choice(order_status)
    ])

columns = [
    'order_id',
    'customer_id',
    'product_id',
    'order_date',
    'product_category',
    'quantity',
    'unit_price',
    'total_price',
    'payment_method',
    'order_status'
]

df = pd.DataFrame(data, columns=columns)

df.head()

,order_id,customer_id,product_id,order_date,product_category,quantity,unit_price,total_price,payment_method,order_status
0,ORD0001,CUST087,PROD059,2023-12-10,Fashion,1,2161,2161,Credit Card,Returned
1,ORD0002,CUST394,PROD085,2024-12-12,Fashion,5,23983,119915,Net Banking,Returned
2,ORD0003,CUST359,PROD004,2023-07-11,Books,4,7663,30652,Net Banking,Returned
3,ORD0004,CUST259,PROD177,2023-11-05,Sports,3,23555,70665,Cash on Delivery,Returned
4,ORD0005,CUST363,PROD101,2023-09-08,Home & Kitchen,1,22180,22180,Credit Card,Delivered

In [2]:
df.head()

,order_id,customer_id,product_id,order_date,product_category,quantity,unit_price,total_price,payment_method,order_status
0,ORD0001,CUST087,PROD059,2023-12-10,Fashion,1,2161,2161,Credit Card,Returned
1,ORD0002,CUST394,PROD085,2024-12-12,Fashion,5,23983,119915,Net Banking,Returned
2,ORD0003,CUST359,PROD004,2023-07-11,Books,4,7663,30652,Net Banking,Returned
3,ORD0004,CUST259,PROD177,2023-11-05,Sports,3,23555,70665,Cash on Delivery,Returned
4,ORD0005,CUST363,PROD101,2023-09-08,Home & Kitchen,1,22180,22180,Credit Card,Delivered

In [3]:
df.to_csv('../data/ecommerce_sales.csv', index=False)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   object
 1   customer_id       1000 non-null   object
 2   product_id        1000 non-null   object
 3   order_date        1000 non-null   object
 4   product_category  1000 non-null   object
 5   quantity          1000 non-null   int64
 6   unit_price        1000 non-null   int64
 7   total_price       1000 non-null   int64
 8   payment_method    1000 non-null   object
 9   order_status      1000 non-null   object
dtypes: int64(3), object(7)
memory usage: 78.3+ KB

In [5]:
df['order_date'] = pd.to_datetime(df['order_date'])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          1000 non-null   object
 1   customer_id       1000 non-null   object
 2   product_id        1000 non-null   object
 3   order_date        1000 non-null   datetime64[ns]
 4   product_category  1000 non-null   object
 5   quantity          1000 non-null   int64
 6   unit_price        1000 non-null   int64
 7   total_price       1000 non-null   int64
 8   payment_method    1000 non-null   object
 9   order_status      1000 non-null   object
dtypes: datetime64[ns](1), int64(3), object(6)
memory usage: 78.3+ KB

In [7]:
df.isnull().sum()

order_id            0
customer_id         0
product_id          0
order_date          0
product_category    0
quantity            0
unit_price          0
total_price         0
payment_method      0
order_status        0
dtype: int64

In [9]:
df['product_category'] = df['product_category'].str.title().str.strip()
df['payment_method'] = df['payment_method'].str.title().str.strip()
df['order_status'] = df['order_status'].str.title().str.strip()

In [10]:
(df[['quantity', 'unit_price', 'total_price']] <= 0).sum()

quantity       0
unit_price     0
total_price    0
dtype: int64

In [11]:
df.head()

,order_id,customer_id,product_id,order_date,product_category,quantity,unit_price,total_price,payment_method,order_status
0,ORD0001,CUST087,PROD059,2023-12-10,Fashion,1,2161,2161,Credit Card,Returned
1,ORD0002,CUST394,PROD085,2024-12-12,Fashion,5,23983,119915,Net Banking,Returned
2,ORD0003,CUST359,PROD004,2023-07-11,Books,4,7663,30652,Net Banking,Returned
3,ORD0004,CUST259,PROD177,2023-11-05,Sports,3,23555,70665,Cash On Delivery,Returned
4,ORD0005,CUST363,PROD101,2023-09-08,Home & Kitchen,1,22180,22180,Credit Card,Delivered

In [12]:
# Total Sales
total_sales = df['total_price'].sum()

# Total Orders
total_orders = df.shape[0]

# Average Order Value
average_order_value = total_sales / total_orders

# Unique Customers
unique_customers = df['customer_id'].nunique()

# Display KPIs
print(f"Total Sales: ₹{total_sales:,}")
print(f"Total Orders: {total_orders}")
print(f"Average Order Value: ₹{average_order_value:,.2f}")
print(f"Unique Customers: {unique_customers}")

Total Sales: ₹74,938,811
Total Orders: 1000
Average Order Value: ₹74,938.81
Unique Customers: 366

In [13]:
# Extract month and year
df['year_month'] = df['order_date'].dt.to_period('M')

# Group by month
sales_by_month = df.groupby('year_month')['total_price'].sum().reset_index()

sales_by_month.head()

  year_month  total_price
0    2023-01      2755999
1    2023-02      3774357
2    2023-03      3028729
3    2023-04      2126581
4    2023-05      2774816

In [14]:
# Top 10 Products by Sales
top_products = df.groupby('product_id')['total_price'].sum().sort_values(ascending=False).head(10)
top_products

product_id
PROD099    1108314
PROD230    1055628
PROD015    1011481
PROD245     866683
PROD138     861587
PROD196     779629
PROD170     757105
PROD068     692611
PROD193     690238
PROD154     682657
Name: total_price, dtype: int64

In [15]:
# Top Categories by Sales
top_categories = df.groupby('product_category')['total_price'].sum().sort_values(ascending=False)
top_categories

product_category
Books             15110992
Electronics       12909950
Sports            12157202
Fashion           11644797
Home & Kitchen    11615728
Beauty            11500142
Name: total_price, dtype: int64